[Killed] StringLiteral
sd-03-block16-project-react-testing-library/src/components/PokemonDetails.js:13:37
   static renderHabitat({ foundAt, name }) {
     return (
       <section>
-        <h2>{`Game Locations of ` + `${name}`}</h2>
+        <h2>{`Game Locations of ` + ""}</h2>
         <div className="pokemon-habitat">
           {foundAt.map(({ location, map }) => (

[Killed] StringLiteral
sd-03-block16-project-react-testing-library/src/components/PokemonDetails.js:17:53
         <div className="pokemon-habitat">
           {foundAt.map(({ location, map }) => (
             <div key={location}>
-              <img src={`${map}`} alt={`${name} ` + `location`} />
+              <img src={`${map}`} alt={`${name} ` + ""} />
               <p><em>{location}</em></p>
             </div>

[Killed] StringLiteral
sd-03-block16-project-react-testing-library/src/components/PokemonDetails.js:17:25
         <div className="pokemon-habitat">
           {foundAt.map(({ location, map }) => (
             <div key={location}>
-              <img src={`${map}`} alt={`${name} ` + `location`} />
+              <img src={""} alt={`${name} ` + `location`} />
               <p><em>{location}</em></p>
             </div>

[Killed] StringLiteral
sd-03-block16-project-react-testing-library/src/components/PokemonDetails.js:29:15
   static renderSummary({ summary }) {
     return (
       <section>
-        <h2> {`Summary`} </h2>
+        <h2> {""} </h2>
         <p>
           {`${summary}`}

[Killed] StringLiteral
sd-03-block16-project-react-testing-library/src/components/PokemonDetails.js:55:12
     return (
       <form className="favorite-form">
         <label htmlFor="favorite">
-          {`Pokémon favoritado?`}
+          {""}
           <input
             type="checkbox"
